In [7]:
import numpy as np
import pandas as pd

In [8]:
df=pd.read_csv('data.csv')

In [9]:
test_df=pd.read_csv('test1.csv',sep=';')

In [10]:
test_df.head()

  Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [11]:
df.head()

  Programming language        Designed by  Appeared Extension
0               Python   Guido van Rossum      1991       .py
1                 Java      James Gosling      1995     .java
2                  C++  Bjarne Stroustrup      1983      .cpp

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Programming language  3 non-null      object
 1   Designed by           3 non-null      object
 2   Appeared              3 non-null      int64
 3   Extension             3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [13]:
#when you using this funcion the category feauture will be skipped because you cannot find out the count,mean,std,min......etc of category feautures
df.describe()

          Appeared
count     3.000000
mean   1989.666667
std       6.110101
min    1983.000000
25%    1987.000000
50%    1991.000000
75%    1993.000000
max    1995.000000

In [14]:
df['Appeared'].value_counts()

1991    1
1983    1
1995    1
Name: Appeared, dtype: int64

In [15]:
df[df['Appeared']>100]

  Programming language        Designed by  Appeared Extension
0               Python   Guido van Rossum      1991       .py
1                 Java      James Gosling      1995     .java
2                  C++  Bjarne Stroustrup      1983      .cpp

# csv

In [16]:
from io import StringIO,BytesIO

In [17]:
data=('col1,col2,col3\n'
               'x,y,1\n'
               'a,b,2\n'
               'c,d,3\n')

In [18]:
print(data)

col1,col2,col3
x,y,1
a,b,2
c,d,3

In [19]:
type(data)

str

In [20]:
pd.read_csv(StringIO(data)) #created text memory buffer

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [21]:
##read from specific columns
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [22]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [23]:
df.to_csv('test.csv') # to save back to csv file

In [24]:
##specifying columns data types
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11,12')

In [25]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [26]:
df=pd.read_csv(StringIO(data),dtype=object) #you can convert dtype into object,int,float

In [27]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [28]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [29]:
df['a'][1]

'5'

In [30]:
df=pd.read_csv(StringIO(data),dtype={'a':'int32','b':float,'c':int})

In [31]:
df

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [32]:
type(df['a'][2])

numpy.int32

In [33]:
df['b']

0     2.0
1     6.0
2    10.0
Name: b, dtype: float64

In [34]:
df['c']

0     3
1     7
2    11
Name: c, dtype: int32

In [35]:
##check the data type
df.dtypes

a      int32
b    float64
c      int32
d      int64
dtype: object

In [36]:
##index columns and training delimiters

In [37]:
data=('index,a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cow')

In [38]:
print(data)

index,a,b,c
4,apple,bat,5.7
8,orange,cow

In [39]:
pd.read_csv(StringIO(data))

   index       a    b    c
0      4   apple  bat  5.7
1      8  orange  cow  NaN

In [40]:
pd.read_csv(StringIO(data),index_col=0)  # the index_col you can change from 0,1,2,3.....

            a    b    c
index
4       apple  bat  5.7
8      orange  cow  NaN

In [41]:
data=('index,a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cow')

In [42]:
print(data)

index,a,b,c
4,apple,bat,
8,orange,cow

In [48]:
pd.read_csv(StringIO(data))

   index       a    b   c
0      4   apple  bat NaN
1      8  orange  cow NaN

In [50]:
pd.read_csv(StringIO(data),index_col=False) # when you put false the NaN exprn will be removed

   index       a    b   c
0      4   apple  bat NaN
1      8  orange  cow NaN

In [51]:
##combining usecols and index_col
data=('a,b,c\n'
     'apple,bat\n'
     'orange,10')

In [52]:
print(data)

a,b,c
apple,bat
orange,10

In [58]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False) #here the NaN will be removed and a adjusted to b, b adjusted to c

     b   c
0  bat NaN
1   10 NaN

In [59]:
##quoting and escape characters..#very useful in NLP
data='a,b\n"Hello\\"bob\\",nice to see you",5'

In [60]:
print(data)

a,b
"Hello\"bob\",nice to see you",5

In [62]:
pd.read_csv(StringIO(data),escapechar='\\')  #using inbuilt parameter 'escapechar'  to solved this

                            a  b
0  Hello"bob",nice to see you  5

In [67]:
##URL to csv
df=pd.read_csv('http://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [68]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358